## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: gcp/prod
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # argocd_application.cinema is tainted, so must be replaced
-/+ resource "argocd_application" "cinema" {
!       id      = "cinema" -> (known after apply)
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 37 -> (known after apply)
            name             = "cinema"
!           resource_version = "1905589" -> (known after apply)
!           uid              = "6099a3e8-f390-4fc9-9955-1db7aa0d9470" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

!       spec {
            # (2 unchanged attributes hidden)

            destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

!           source {
                # (3 unchanged attributes hidden)

!               helm {
-                   skip_crds    = false -> null
-                   value_files  = [] -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }
    }

  # argocd_application.cinema-robusta is tainted, so must be replaced
-/+ resource "argocd_application" "cinema-robusta" {
!       id      = "robusta" -> (known after apply)
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 16 -> (known after apply)
            name             = "robusta"
!           resource_version = "1905593" -> (known after apply)
!           uid              = "906dab51-a7a9-43e9-8b13-9b27b6461d93" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

!       spec {
            # (2 unchanged attributes hidden)

            destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

!           source {
                # (4 unchanged attributes hidden)

!               helm {
-                   value_files  = [] -> null
                    # (3 unchanged attributes hidden)

!                   parameter {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                }
            }

!           sync_policy {
-               automated    = {} -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # argocd_application.keda-scaledobject-cinema-bookings is tainted, so must be replaced
-/+ resource "argocd_application" "keda-scaledobject-cinema-bookings" {
!       id      = "keda-cinema-bookings" -> (known after apply)
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 12 -> (known after apply)
            name             = "keda-cinema-bookings"
!           resource_version = "1905585" -> (known after apply)
!           uid              = "59e5dd87-1907-4e2e-affb-587cffe9a738" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

!       spec {
            # (2 unchanged attributes hidden)

            destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

!           source {
                # (3 unchanged attributes hidden)

!               helm {
-                   skip_crds    = false -> null
-                   value_files  = [] -> null
                    # (1 unchanged attribute hidden)

-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.name" -> null
-                       value        = "cinema-bookings" -> null
                    }
-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.namespace" -> null
-                       value        = "cinema" -> null
                    }
-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.scaletargetname" -> null
-                       value        = "cinema-bookings" -> null
                    }
+                   parameter {
+                       name  = "keda.name"
+                       value = "cinema-bookings"
                    }
+                   parameter {
+                       name  = "keda.namespace"
+                       value = "cinema"
                    }
+                   parameter {
+                       name  = "keda.scaletargetname"
+                       value = "cinema-bookings"
                    }
                }
            }
        }
    }

  # argocd_application.keda-scaledobject-cinema-movies is tainted, so must be replaced
-/+ resource "argocd_application" "keda-scaledobject-cinema-movies" {
!       id      = "keda-cinema-movies" -> (known after apply)
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 12 -> (known after apply)
            name             = "keda-cinema-movies"
!           resource_version = "1905587" -> (known after apply)
!           uid              = "33e5cdee-1e3e-46b0-8c60-4ee8f9e4054e" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

!       spec {
            # (2 unchanged attributes hidden)

            destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

!           source {
                # (3 unchanged attributes hidden)

!               helm {
-                   skip_crds    = false -> null
-                   value_files  = [] -> null
                    # (1 unchanged attribute hidden)

-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.name" -> null
-                       value        = "cinema-movies" -> null
                    }
-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.namespace" -> null
-                       value        = "cinema" -> null
                    }
-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.scaletargetname" -> null
-                       value        = "cinema-movies" -> null
                    }
+                   parameter {
+                       name  = "keda.name"
+                       value = "cinema-movies"
                    }
+                   parameter {
+                       name  = "keda.namespace"
+                       value = "cinema"
                    }
+                   parameter {
+                       name  = "keda.scaletargetname"
+                       value = "cinema-movies"
                    }
                }
            }
        }
    }

  # argocd_application.keda-scaledobject-cinema-showtimes is tainted, so must be replaced
-/+ resource "argocd_application" "keda-scaledobject-cinema-showtimes" {
!       id      = "keda-cinema-showtimes" -> (known after apply)
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 12 -> (known after apply)
            name             = "keda-cinema-showtimes"
!           resource_version = "1905586" -> (known after apply)
!           uid              = "1c8362a3-7f86-46c7-a5b8-b090591b2e84" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

!       spec {
            # (2 unchanged attributes hidden)

            destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

!           source {
                # (3 unchanged attributes hidden)

!               helm {
-                   skip_crds    = false -> null
-                   value_files  = [] -> null
                    # (1 unchanged attribute hidden)

-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.name" -> null
-                       value        = "cinema-showtimes" -> null
                    }
-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.namespace" -> null
-                       value        = "cinema" -> null
                    }
-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.scaletargetname" -> null
-                       value        = "cinema-showtimes" -> null
                    }
+                   parameter {
+                       name  = "keda.name"
+                       value = "cinema-showtimes"
                    }
+                   parameter {
+                       name  = "keda.namespace"
+                       value = "cinema"
                    }
+                   parameter {
+                       name  = "keda.scaletargetname"
+                       value = "cinema-showtimes"
                    }
                }
            }
        }
    }

  # argocd_application.keda-scaledobject-cinema-users is tainted, so must be replaced
-/+ resource "argocd_application" "keda-scaledobject-cinema-users" {
!       id      = "keda-cinema-users" -> (known after apply)
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 12 -> (known after apply)
            name             = "keda-cinema-users"
!           resource_version = "1905588" -> (known after apply)
!           uid              = "7d8ab1c6-13a7-4f50-b7de-541363a618f6" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

!       spec {
            # (2 unchanged attributes hidden)

            destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

!           source {
                # (3 unchanged attributes hidden)

!               helm {
-                   skip_crds    = false -> null
-                   value_files  = [] -> null
                    # (1 unchanged attribute hidden)

-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.name" -> null
-                       value        = "cinema-users" -> null
                    }
-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.namespace" -> null
-                       value        = "cinema" -> null
                    }
-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.scaletargetname" -> null
-                       value        = "cinema-users" -> null
                    }
+                   parameter {
+                       name  = "keda.name"
+                       value = "cinema-users"
                    }
+                   parameter {
+                       name  = "keda.namespace"
+                       value = "cinema"
                    }
+                   parameter {
+                       name  = "keda.scaletargetname"
+                       value = "cinema-users"
                    }
                }
            }
        }
    }

  # kubernetes_namespace.cinema will be updated in-place
!   resource "kubernetes_namespace" "cinema" {
        id = "cinema"

!       metadata {
!           annotations      = {
-               "mesh.cloud.google.com/proxy" = jsonencode(
                    {
-                       managed = "true"
                    }
                ) -> null
            }
            name             = "cinema"
            # (4 unchanged attributes hidden)
        }
    }

Plan: 6 to add, 1 to change, 6 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:gcp/prod workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 248.11 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| gcp/prod | default | 0.00 | 248.11 | 248.11|
| | **Total** | **0.00** | **248.11** | **248.11** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
